NicPare/GBM2100/Laboratoire3.cydsn/Generated_Source/PSoC6/CapSense_1_Structure.h
/* Bit 12: 5x5 centroid Enable/Disable. */
#define CapSense_1_CENTROID_5X5_SIZE      (0x00000001Lu)
#define CapSense_1_CENTROID_5X5_SHIFT     (12u)
#define CapSense_1_CENTROID_5X5_MASK      (CapSense_1_CENTROID_5X5_SIZE << CapSense_1_CENTROID_5X5_SHIFT)

/* Bit 13: Edge correction Enable/Disable. */
#define CapSense_1_EDGE_CORRECTION_SIZE   (0x00000001Lu)
#define CapSense_1_EDGE_CORRECTION_SHIFT  (13u)
#define CapSense_1_EDGE_CORRECTION_MASK   (CapSense_1_EDGE_CORRECTION_SIZE << CapSense_1_EDGE_CORRECTION_SHIFT)

/* Bit 14: Two finger detection Enable/Disable. */
#define CapSense_1_TWO_FINGER_DETECTION_SIZE (0x00000001Lu)
#define CapSense_1_TWO_FINGER_DETECTION_SHIFT (14u)
#define CapSense_1_TWO_FINGER_DETECTION_MASK (CapSense_1_TWO_FINGER_DETECTION_SIZE << CapSense_1_TWO_FINGER_DETECTION_SHIFT)


/*******************************************************************************
* Defines Data Structure Macro helpers
*******************************************************************************/

/*******************************************************************************
* Determines the widget specific word in the wdgtStatus array by widget ID
*******************************************************************************/
/* Divide by 32 - size of the wdgtStatus word in bits to find the word index */
#define CapSense_1_GET_WDGT_STATUS_INDEX(wdgtId)  ((wdgtId) >> 5u)

/*******************************************************************************
* Determines the widget bitmask in wdgtStatus word by widget ID
*******************************************************************************/
/* Take the least 5 bits of widget id to find the bit number */
#define CapSense_1_GET_WDGT_STATUS_MASK(wdgtId)   (1Lu << ((wdgtId) & 0x1FLu))

/*******************************************************************************
* Determines the sense method of the widget
*******************************************************************************/
#if (0u != CapSense_1_TOTAL_CSD_WIDGETS) && (0u != CapSense_1_TOTAL_CSX_WIDGETS)
    #define CapSense_1_GET_SENSE_METHOD(ptrFlash) ((CapSense_1_SENSE_METHOD_ENUM)(ptrFlash)->senseMethod)
#else
    #if (0u != CapSense_1_TOTAL_CSX_WIDGETS)
        #define CapSense_1_GET_SENSE_METHOD(ptrFlash) CapSense_1_SENSE_METHOD_CSX_E
    #else
        #define CapSense_1_GET_SENSE_METHOD(ptrFlash) CapSense_1_SENSE_METHOD_CSD_E
    #endif /* #if (0u != CapSense_1_TOTAL_CSX_WIDGETS) */
#endif /* #if (0u != CapSense_1_TOTAL_CSD_WIDGETS) && (0u != CapSense_1_TOTAL_CSX_WIDGETS) */

/*******************************************************************************
* Gets the widget type
*******************************************************************************/
#define CapSense_1_GET_WIDGET_TYPE(ptrFlashWdgt)  ((CapSense_1_WD_TYPE_ENUM)((ptrFlashWdgt)->wdgtType))

/*******************************************************************************
* Gets the number of the widget's sensors
*******************************************************************************/
#define CapSense_1_GET_SENSOR_COUNT(widgetId)         CapSense_1_dsFlash.wdgtArray[(widgetId)].totalNumSns
#define CapSense_1_GET_SNS_CNT_BY_PTR(ptrFlashWidget) (ptrFlashWidget)->totalNumSns

/*******************************************************************************
* Increments the pointer to the Regular Filter History Object
*******************************************************************************/
#if (0u != CapSense_1_REGULAR_RC_ALP_FILTER_EN)
    #define CapSense_1_INC_REG_FLTR_OBJ(fltrVariant)      \
        do {                                                    \
            (fltrVariant).ptrAlp++;                             \
        } while(0)
#elif (0u != CapSense_1_REGULAR_RC_FILTER_EN)
    #define CapSense_1_INC_REG_FLTR_OBJ(fltrVariant)      \
        do {                                                    \
            (fltrVariant).ptrRegular++;                         \
        } while(0)
#else
    #define CapSense_1_INC_REG_FLTR_OBJ(fltrVariant)      \
        do {                                                    \
        } while(0)
#endif

/*******************************************************************************
* Increments the pointer to the Proximity Filter History Object
*******************************************************************************/
#if (0u != CapSense_1_PROX_RC_ALP_FILTER_EN)
    #define CapSense_1_INC_PROX_FLTR_OBJ(fltrVariant)     \
        do {                                                    \
            (fltrVariant).ptrAlp++;                             \
        } while(0)
#elif (0u != CapSense_1_PROX_RC_FILTER_EN)
    #define CapSense_1_INC_PROX_FLTR_OBJ(fltrVariant)     \
        do {                                                    \
            (fltrVariant).ptrProx++;                            \
        } while(0)
#else
    #define CapSense_1_INC_PROX_FLTR_OBJ(fltrVariant)     \
        do {                                                    \
        } while(0)
#endif

/*******************************************************************************
* Increments the pointer to the Filter History Object Variant
*******************************************************************************/
#define CapSense_1_INC_FLTR_OBJ_VARIANT(isProxHistObj, fltrVariant)   \
    do {                                                                    \
        if (0u == (isProxHistObj))                                          \
        {                                                                   \
            CapSense_1_INC_REG_FLTR_OBJ(fltrVariant);                 \
        }                                                                   \
        else                                                                \
        {                                                                   \
            CapSense_1_INC_PROX_FLTR_OBJ(fltrVariant);                \
        }                                                                   \
    } while(0)

