NicPare/GBM2100/Laboratoire3.cydsn/Generated_Source/PSoC6/CapSense_1_Structure.h
/*******************************************************************************
* Gets a widget status in the global enable register dsRam.wdgtEnable[]
*******************************************************************************/
#if (CapSense_1_ENABLE == CapSense_1_SELF_TEST_EN)
    #define CapSense_1_GET_WIDGET_EN_STATUS(wdId)                                                     \
                 (CapSense_1_GET_WDGT_STATUS_MASK(wdId) &                                             \
                  CapSense_1_dsRam.wdgtEnable[CapSense_1_GET_WDGT_STATUS_INDEX(wdId)] &         \
                  CapSense_1_dsRam.wdgtWorking[CapSense_1_GET_WDGT_STATUS_INDEX(wdId)])
#else
    #define CapSense_1_GET_WIDGET_EN_STATUS(wdId)                    \
                (CapSense_1_GET_WDGT_STATUS_MASK(wdId) &             \
                 CapSense_1_dsRam.wdgtEnable[CapSense_1_GET_WDGT_STATUS_INDEX(wdId)])
#endif /* (CapSense_1_ENABLE == CapSense_1_SELF_TEST_EN) */

/*******************************************************************************
* Gets a widget active status from the dsRam.wdgtStatus[] register
*******************************************************************************/
#define CapSense_1_GET_WIDGET_ACTIVE_STATUS(wdId)                    \
            (CapSense_1_GET_WDGT_STATUS_MASK(wdId) &                 \
             CapSense_1_dsRam.wdgtStatus[CapSense_1_GET_WDGT_STATUS_INDEX(wdId)])

/*******************************************************************************
* Declares Flash and RAM Data Structure variables
*******************************************************************************/
extern CapSense_1_RAM_STRUCT            CapSense_1_dsRam;
extern const CapSense_1_FLASH_STRUCT    CapSense_1_dsFlash;
extern const CapSense_1_FLASH_IO_STRUCT CapSense_1_ioList[CapSense_1_TOTAL_ELECTRODES];
extern const CapSense_1_RAM_WD_LIST_STRUCT CapSense_1_ramWidgetInit;
extern const uint8 CapSense_1_ramIdacInit[CapSense_1_TOTAL_SENSORS];






/*******************************************************************************
* Function Prototypes
*******************************************************************************/

/*******************************************************************************
* High-level API
*******************************************************************************/

/**
* \cond SECTION_CYSENSE_HIGH_LEVEL
* \addtogroup group_cysense_high_level
* \{
*/

uint32 CapSense_1_IsAnyWidgetActive(void);
uint32 CapSense_1_IsWidgetActive(uint32 widgetId);
uint32 CapSense_1_IsSensorActive(uint32 widgetId, uint32 sensorId);

#if (0u != CapSense_1_MATRIX_WIDGET_EN)
    uint32 CapSense_1_IsMatrixButtonsActive(uint32 widgetId);
#endif /* #if (0u != CapSense_1_MATRIX_WIDGET_EN) */

#if (0u != CapSense_1_PROXIMITY_WIDGET_EN)
    uint32 CapSense_1_IsProximitySensorActive(uint32 widgetId, uint32 proxId);
#endif /* #if (0u != CapSense_1_PROXIMITY_WIDGET_EN) */

#if (0u != CapSense_1_SLIDER_WIDGET_EN)
    uint32 CapSense_1_GetCentroidPos(uint32 widgetId);
#endif /* #if (0u != CapSense_1_SLIDER_WIDGET_EN) */

#if (0u != CapSense_1_TOUCHPAD_WIDGET_EN)
    uint32 CapSense_1_GetXYCoordinates(uint32 widgetId);
#endif /* #if (0u != CapSense_1_TOUCHPAD_WIDGET_EN) */

/** \}
* \endcond */

/*******************************************************************************
* Low level API
*******************************************************************************/

/**
* \cond SECTION_CYSENSE_LOW_LEVEL
* \addtogroup group_cysense_low_level
* \{
*/

cy_status CapSense_1_GetParam(uint32 paramId, uint32 *value);
cy_status CapSense_1_SetParam(uint32 paramId, uint32 value);

/** \}
* \endcond */

/*******************************************************************************
* Function Prototypes - internal functions
*******************************************************************************/
/**
* \cond SECTION_CYSENSE_INTERNAL
* \addtogroup group_cysense_internal
* \{
*/



void CapSense_1_DsInitialize(void);
#if (0u != CapSense_1_ADC_EN)
    void CapSense_1_AdcDsInitialize(void);
#endif /* (0u != CapSense_1_ADC_EN) */

/** \}
* \endcond */

#endif /* End CY_SENSE_CapSense_1_STRUCTURE_H */

/* [] END OF FILE */
